Revit 2027 API
Element.CanBeLocked Method
 Identifies if the element can be locked.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanBeLocked()
Public Function CanBeLocked As Boolean
public:
bool CanBeLocked()
member CanBeLocked : unit -> bool
Return Value
Boolean
 True if the element can be locked, false otherwise.
See Also
Reference
Element Class
Autodesk.Revit.DB Namespace